Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: *-bitcoin-really-decentralized/*.po
Languages: pt

source: Is Bitcoin really decentralized?
pt: O Bitcoin é realmente descentralizado?

source: When we talk about decentralization and centralization, it’s not like black and white. Instead, there’s a whole range of grays in the middle.
pt: Quando falamos de descentralização e centralização, não é tudo preto e branco. Pelo contrário, há toda uma gama de cinzas no meio.

source: Being more decentralized or less is a thing.
pt: Pode-se dizer que algo é mais descentralizado ou menos.

source: Fully centralized
pt: Totalmente centralizado

source: Nuance of centralization
pt: Nuance de centralização

source: Fully decentralized
pt: Totalmente descentralizado

source: Also, decentralization doesn’t mean good while centralization means bad. Both can be useful depending on the context, we just have to know when.
pt: Além disso, descentralização não quer dizer bom enquanto centralização quer dizer mau. Ambos modelos são úteis dependendo do contexto, nós apenas precisamos saber quando empregá-los.

source: But enough with the introduction:
pt: Ok, já está bom de introdução:

source: How decentralized is Bitcoin?
pt: O quão descentralizado é o Bitcoin?

source: Nodes
pt: Nós

source: Node decentralization is essential for a healthy Bitcoin. But not just any node, an economically active full node.
pt: A descentralização dos nós é essencial para um Bitcoin saudável. Mas não apenas qualquer nó, um nó economicamente ativo.

source: The nodes that really make a difference in the decision of protocol changes are the ones that accept transactions and validate them using their own full nodes, usually merchants. That’s what we call the economic majority.
pt: Os nós que realmente fazem a diferença na decisão de mudanças no protocolo são aqueles que aceitam transações e as validam usando seus próprios nós completos, normalmente comerciantes. Isto é o que chamamos de maioria econômica.

source: If there were fewer merchants, there would be fewer people to enforce Bitcoin’s consensus rules, leaving it more prone to manipulation.
pt: Se houvesse menos comerciantes, haveria menos pessoas para forçar as regras de consenso do Bitcoin, deixando o sistema mais passível de manipulação.

source: Mining
pt: Mineração

source: Mining is pretty centralized nowadays. It can happen in a variety of ways, such as the centralization of:
pt: A mineração é bem centralizada, atualmente. Isto pode acontecer de mais de uma forma, como a centralização de:

source: Hardware suppliers
pt: Oferta de hardware

source: Miners (pooling)
pt: Mineradores (pooling)

source: Location of mining operations
pt: Localização da operação de mineração

source: With a centralized mining, the inclusion of transactions in the blockchain is less secure.
pt: Com uma mineração centralizada, a inclusão de transações na blockchain é menos segura.

source: Operations that hold too much mining power can effectively censor and, at some point, reorder transactions.
pt: Operações que possuem demasiado poder de mineração podem efetivamente censurar e, em algum ponto, reordenar transações.

source: New POW
pt: Novo POW

source: One of the considered wepons against centralized mining is a thoroughly planned change in the Proof-of-Work algorithm, which would render all current mining hardware useless.
pt: Uma das armas consideradas contra a centralização da mineração é a mudança muito bem planejada do algoritmo de Proof-of-Work, o que tornaria inúteis os atuais hardwares de mineração.

source: Development
pt: Desenvolvimento

source: Most nodes currently use one single Bitcoin implementation, that’s quite centralized.
pt: A maior parte dos nós usa, hoje em dia, uma mesma implementação do Bitcoin. Isto é bem centralizado.

source: Positive side:
pt: Lado positivo:

source: Avoids problems with the consensus rules (different implementations might be incompatible).
pt: Evita problemas com as regras de consenso (implementações diferentes podem ser incompatíveis).

source: Negative side:
pt: Lado negativo:

source: The main team of developers has the possibility of over influencing the system.
pt: O principal time de desenvolvimento tem a possibilidade de influenciar demais o sistema.

source: The centralization of development has worked well until now, but it’s pointed as a possible issue in the future.
pt: A centralização do desenvolvimento funcionou bem até agora, mas é apontada como um possível problema no futuro.

source: The protection against this lies in the fact that the code is open and people can choose if they will run it or not.
pt: A proteção contra isso está no fato de que o código é aberto e as pessoas podem escolher se o usam ou não.

source: Also, the software license allows anyone to start working on their own implementation of Bitcoin.
pt: Também, a licença do software permite que qualquer um comece a trabalhar na sua própria implementação do Bitcoin.

source: Custodial Exchanges and Wallets
pt: Casas de câmbio e carteiras custodiais

source: Even though they are not a fundamental part of Bitcoin’s existence, exchanges have a relevant role since they are the main interface with the traditional economic system.
pt: Embora não sejam uma parte fundamental do Bitcoin, casas de câmbio possuem um papel relevante por serem a principal interface com o sistema econômico tradicional.

source: As for custodial wallets, they are chosen, many times, by users who don’t want or don’t know how to protect their private keys. So they outsource the responsibility to a company.
pt: Já as carteiras custodiais são escolhidas, muitas vezes, por usuários que não querem ou não sabem como proteger suas chaves privadas. Logo, eles terceirizam a responsabilidade a uma empresa.

source: In both cases, the more centralized they are, the easier it is to steal funds from a large number of people and cause a market disruption as they become huge honeypots for attackers.
pt: Em ambos os casos, quanto mais centralizados forem, mais fácil é roubar fundos de um grande número de pessoas e causar uma perturbação no mercado, já que eles se tornam grandes atrativos para atacantes.

source: Decentralized and non-custodial exchanges, and non-custodial wallets are a better approach to avoid a huge concentration of funds in one place.
pt: Casas de câmbio descentralizadas e não custodiais, e carteiras não custodiais são uma abordagem melhor para evitar o problema de uma enorme concentração de fundos em um único lugar.

source: So what is the conclusion here?
pt: Qual é a conclusão aqui?

source: Bitcoin is still well enough to keep going for now. But it should be an ongoing concern to take care of its degree of decentralization and the attack vectors originated by it.
pt: O Bitcoin ainda está bem o suficiente para funcionar, por agora. No entanto, deveria haver uma preocupação contínua com o seu grau de descentralização e os vetores de ataque decorrentes disto.

source: Otherwise, we’ll be just waiting for a time bomb to go off when some of these elements get out of control.
pt: Caso contrário, estaremos apenas esperando uma bomba-relógio estourar quando um destes elementos sair do controle.

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão

source: Sources: https://github.com/libbitcoin/libbitcoin/wiki/Centralization-Risk
pt: Fontes: https://github.com/libbitcoin/libbitcoin/wiki/Centralization-Risk
