Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: what-*-bitcoin-the-currency/was-ist-bitcoin-die-währung.po
Languages: de_ch

source: WHAT IS BITCOIN? - The Currency
de_ch: WAS IST BITCOIN - Die Währung

source: breaking in pieces
de_ch: In Puzzlestücke zerlegt

source: Digital Currency
de_ch: Digitale Währung

source: It’s all about ones and zeros, meaning it has no physical form such as a coin.
de_ch: Es funktioniert alles über Nullen und Einsen, sprich es gibt sie nicht in physischer Form zum Beispiel als Münzen.

source: Cryptocurrency
de_ch: Kryptowährung

source: Based on mathematics and cryptography. Which means it can’t be counterfeit - math doesn’t lie.
de_ch: Basierend auf Mathematik und Kryptographie. Das bedeutet, dass sie nicht gefälscht werden können - Mathematik lügt nicht.

source: limited amount
de_ch: Limitierte Anzahl

source: There is a limit of roughly 21 million bitcoins to be ever put in circulation.
de_ch: Es existiert ein Limit von knapp 21 Millionen Bitcoins welche jemals im Umlauf sein werden.

source: It doesn’t allow anyone to print more bitcoins recklessly, which preserves the currency value - it’s scarce.
de_ch: Es ist niemandem erlaubt Bitcoins aus dem Nichts zu erschaffen, was den Wert der Währung sichert - sie bleiben knapp.

source: ownership records
de_ch: Eigentumsverzeichnis

source: Bitcoin ownership is actually a record on the Blockchain - this big decentralized ledger - saying those bitcoins were transferred to you.
de_ch: Bitcoins zu besitzen ist ein Eintrag auf der Blockchain - ein grosses dezentrales Register - welche besagt, dass die Bitcoins zu dir transferiert wurden.

source: It’s a type of math problem that needs a lot of processing power. It’s used for writing transactions and those who do it are rewarded with transaction fees and new bitcoins, which is how the currency is issued.
de_ch: Beim Mining werden Mathematische Probleme gelöst welche viel Rechenkapazität brauchen. Diese Rechenkapazität wird verwendet um Transaktionen abzuwickeln. Diejenigen welche Transaktionen verifizieren werden mit Transaktionsgebühren und neuen Bitcoins belohnt, so wird die Währung emittiert.

source: divisibility
de_ch: Teilbarkeit

source: The smallest unit of Bitcoin is a Satoshi; it represents one hundred millionth of a bitcoin. But, if needed, this part can become even smaller.
de_ch: Die kleinste Einheit von Bitcoin ist ein Satoshi; Dieser repräsentiert ein Hundert Millionstel eines Bitcoins. Falls notwendig, kann dieser Bruchteil auch kleiner werden.

source: the features
de_ch: Die Funktionen

source: or... Why everyone is so crazy about it
de_ch: oder... Wieso jeder so euphorisch ist

source: Critical (break these and Bitcoin will never be the same)
de_ch: Entscheidend (Ohne diese wird Bitcoin niemals dasselbe sein)

source: Decentralized
de_ch: Dezentral

source: No central bank can freeze your accounts or implement poorly conceived policies that devalue your currency.
de_ch: Keine Zentralbank kann dein Konto einfrieren, oder schlecht durchdachte Geldpolitik implementieren, welche den Wert deiner Währung verringert.

source: No Red-Tape
de_ch: Keine Bürokratie

source: Anyone can use bitcoin, no questions, no documents and no custody fees.
de_ch: Jeder kann Bitcoin verwenden, keine Fragen, Dokumente oder Depotgebühren.

source: Pretty Anonymous
de_ch: Anonymität

source: Your name isn’t linked to your transactions, making it a lot more private and safe than regular bank operations and credit card payments.
de_ch: Dein Name ist nicht mit deinen Transaktionen verlinkt, was bitcoin privater und sicherer macht als reguläre Banküberweisungen und Kreditkartenzahlungen.

source: Non-repudiable
de_ch: Nicht umkehrbar

source: Once a bitcoin transaction is confirmed, it can’t be reverted unless there is a voluntary agreement between the two parties - such as a store policy.
de_ch: Ist eine Bitcointransaktion bestätigt, kann diese nicht wieder rückgängig gemacht werden ausser es gibt eine freiwillige Übereinkunft zwischen den zwei Parteien.

source: Everyone can check every address and its transactions - although you don’t know the owners of all addresses, only those identities that were entrusted to you.
de_ch: Jeder kann jede Adresse und ihre Transaktionen überprüfen - auch wenn du nicht den Besitzer aller Adressen kennst, ausser die Identitäten welche dir anvertraut wurden.

source: changeable (market development might change these a little)
de_ch: Veränderbar (Marktentwicklung könnten diese ein wenig ändern)

source: Fast
de_ch: Schnell

source: Transactions can reach anyone in any part of the world within minutes.
de_ch: Transaktionen können jeden überall in der Welt innerhalb Minuten erreichen.

# ./what-is-bitcoin-the-currency/source-text.txt:66
source: Possible Change
de_ch: Mögliche Veränderung

source: If the volume of transactions grows a lot - say, bitcoin becoming mainstream - transactions will take longer to be cleared on the blockchain.
de_ch: Falls das Transaktionsvolumen stark ansteigt - etwa wenn Bitcoin Mainstream wird - werden Transaktionen länger brauchen bis sie auf der Blockchain verifiziert werden.

# ./what-is-bitcoin-the-currency/source-text.txt:70
source: What Might Happen
de_ch: Was passieren könnte

source: Besides measures to scale Bitcoin’s core, small and quick transactions will probably be cleared by third parties or other layers over the blockchain.
de_ch: Abgesehen von Massnahmen um Bitcoin's Blockchain zu skalieren, zeichnet sich ab, dass kleinere und schnellere Transaktionen von Drittpartien oder auf anderen höheren Layern über der Blockchain abgewickelt werden.

source: Cheap
de_ch: Günstig

source: Transaction fees are low - currently around 1 USD if you don’t want to wait too much for a confirmation.
de_ch: Transaktionsgebühren sind tief - momentan bei 1 USD wenn du nicht all zu lange auf die Bestätigung warten möchtest.

# ./what-is-bitcoin-the-currency/source-text.txt:78
source: Possible Change
de_ch: Mögliche Veränderung

source: When bitcoin issuing diminishes, the miner’s reward will come mostly from transaction fees, which will be higher.
de_ch: Wenn die Emittierung von Bitcoin zurückgeht, werden Miners überwiegend über Transaktionsgebühren entlohnt werden, welche höher sein werden.

# ./what-is-bitcoin-the-currency/source-text.txt:82
source: What Might Happen
de_ch: Was passieren könnte

source: Predictive calculations indicate that fees will still be very afordable, even when covering all miners expenses alone.
de_ch: Berechnungen gehen davon aus, dass die Gebühren immer noch bezahlbar sein werden, auch wenn diese die Entlohnung der Miner alleine abdecken.

source: Author: Patrícia Estevão
de_ch: Autor: Patrícia Estevão

source: Translator: [Your name/handle or "Crowdsourced translation"]
de_ch: Übersetzung: 21 Lectures AG
