Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: understanding-the-lightning-network-part-3/*.po
Languages: pt, ru

source: Understanding the Lightning Network - Part 3:
pt: Entendendo a Lightning Network - Parte 3:
ru: Принцип работы Lightning Network - Часть 3:

source: Going Off-chain
pt: Saindo da blockchain
ru: Отказываемся от блокчейна

source: Last time, we used HTLC (Hash Time-Locked Contracts) so Alice could pay 1 btc to Carol using the already open channel between Alice and Bob. This effectively turned our bidirectional channel into a network.
pt: Na última vez, nós usamos HTLC (Hash Time-Locked Contracts) para que a Alice pudesse pagar 1 btc à Carol usando o canal que já estava aberto entre Alice e Bob. Isto, efetivamente, transformou o canal bidirecional em uma rede.
ru: Итак, использовали HTLC-контракты чтобы Алиса смогла заплатить Кэрол через существующие каналы между Алисой и Бобом и между Бобом и Кэрол. Таким образом из двунаправленных каналов формируется платежная сеть.

source: Now, we are going to see how the HTLC transaction will be included in the channel balance so that we don’t need to update it immediately on the blockchain.
pt: Agora, nós vamos ver como a transação HTLC será incluída no saldo do canal para que ele não precise ser imediatamente atualizado na blockchain.
ru: Теперь мы посмотрим, как можно включить операции с HTLC-транзакциями в обновление баланса канала чтобы не было необходимости публиковать их в блокчейне.

source: On their last commitment transactions before the HTLC, Alice and Bob had decided on the following balance:
pt: Em suas últimas transações de compromisso antes do HTLC, Alice e Bob estavam com o seguinte saldo:
ru: Последние транзакции-состояния Боба и Алисы до использования HTLC отражают следующий баланс их канала:

source: Three bitcoins for Bob
pt: Três bitcoins para Bob
ru: Три биткоина у Боба

source: Five bitcoins for Alice
pt: Cinco bitcoins para Alice
ru: Пять биткоинов у Алисы

source: To include the HTLC, they will follow almost the same procedure as before.
pt: Para incluir o HTLC, eles seguirão quase o mesmo procedimento de antes.
ru: Чтобы в баланс включить HTLC они должны следовать почти той-же процедуре что и раньше.

source: Create new secret, exchange the hash and create new commitment transactions with the following structure:
pt: Criar um novo segredo, trocar o hash entre eles e criar uma nova transação de compromisso com a seguinte estrutura:
ru: Создание новых "секретов", обмен хешами и создание новых транзакций-состояния со следующей структурой:

source: Alice’s commitment
pt: Transação de compromisso da Alice
ru: Транзакция-состояния Алисы

# ./understanding-the-lightning-network-part-3/source-text.txt:24
source: 4 bitcoins to herself.
pt: 4 bitcoins para si própria.
ru: 4 биткоина себе.

# ./understanding-the-lightning-network-part-3/source-text.txt:28
source: to Alice’s key
pt: p/ a chave da Alice
ru: ключ Алисы

source: 3 bitcoins to a multisig address that can be unlocked by:
pt: 3 bitcoins para um endereço multi-assinatura que pode ser destrancado por:
ru: 3 биткоина на адрес с мультиподписью который может разблокирован:

# ./understanding-the-lightning-network-part-3/source-text.txt:34
source: Bob, after 1000 blocks.
pt: Bob, após 1000 blocos.
ru: Бобом после 1000 блоков.

# ./understanding-the-lightning-network-part-3/source-text.txt:36
source: Alice, if she presents Bob’s secret.
pt: Alice, se ela apresentar o segredo do Bob.
ru: Алисой, если предоставит "секрет" Боба.

source: All businness as usual until now. But then...
pt: Tudo igual a antes, por enquanto. Mas então…
ru: До этого момента все как обычно, но теперь...

# ./understanding-the-lightning-network-part-3/source-text.txt:40
source: 1 bitcoin to a multisig address that can be unlocked by:
pt: 1 bitcoin para um endereço multi-assinatura que pode ser destrancado por:
ru: 1 биткоин на адрес с мультиподписью который может быть разблокирован:

source: Bob, if he presents Carol’s secret and waits 1000 blocks.
pt: Bob, se ele apresentar o segredo da Carol e aguardar 1000 blocos.
ru: Бобом если предоставит секрет Кэрол и подождет 1000 блоков.

source: Security measure to give Alice time to “steal” the funds if Bob drops an old channel state and tries to rob her. In which case, she will unlock like this:
pt: Medida de segurança que dá tempo para Alice “roubar” os fundos caso Bob transmita um estado antigo do canal e tente fraudá-la. Neste caso, ela destrancará os fundos assim:
ru: Мера безопасности, чтобы дать Алисе время «украсть» средства, если Боб попытается обмануть её опубликовав старое состояние канала. В этом случае она сможет разблокировать так:

# ./understanding-the-lightning-network-part-3/source-text.txt:48
source: Alice, after 14 days.
pt: Alice, após 14 dias.
ru: Алисой, после 14 дней.

source: Alice, if she presents Bob’s secret.
pt: Alice, se ela apresentar o segredo do Bob.
ru: Алисой, если она предоставит "секрет" Боба.

source: Bob’s commitment
pt: Transação de compromisso do Bob
ru: Транзакция-состояния Боба

source: 3 bitcoins to himself.
pt: 3 bitcoins para si próprio.
ru: 3 биткоина себе.

# ./understanding-the-lightning-network-part-3/source-text.txt:58
source: to Bob’s key
pt: p/ a chave do Bob
ru: ключ Боба

# ./understanding-the-lightning-network-part-3/source-text.txt:60
source: 4 bitcoins to a multisig address that can be unlocked by:
pt: 4 bitcoins para um endereço multi-assinatura que pode ser destrancado por:
ru: 4 биткоина на адрес с мультиподписью который может разблокирован:

# ./understanding-the-lightning-network-part-3/source-text.txt:64
source: Alice, after 1000 blocks.
pt: Alice, após 1000 blocos.
ru: Алисой после 1000 блоков.

# ./understanding-the-lightning-network-part-3/source-text.txt:66
source: Bob, if he presents Alice’s secret.
pt: Bob, se ele apresentar o segredo da Alice.
ru: Бобом, если он предоставит "секрет" Алисы.

# ./understanding-the-lightning-network-part-3/source-text.txt:68
source: 1 bitcoin to a multisig address that can be unlocked by:
pt: 1 bitcoin para um endereço multi-assinatura que pode ser destrancado por:
ru: 1 биткоин на адрес с мультиподписью который может быть разблокирован:

source: Bob, if he presents Carol’s secret.
pt: Bob, se ele apresentar o segredo da Carol.
ru: Бобом, если он предоставит "секрет" Кэрол.

# ./understanding-the-lightning-network-part-3/source-text.txt:74
source: Alice, after 14 days.
pt: Alice, após 14 dias.
ru: Алисой, после 14 дней.

source: Time for Alice to retrieve the bitcoin in case Bob doesn’t present the secret.
pt: Tempo para Alice recuperar o bitcoin no caso do Bob não apresentar o segredo.
ru: Время, через которое Алиса вернёт себе биткоин в случае если Боб не предоставит "секрет".

# ./understanding-the-lightning-network-part-3/source-text.txt:78
source: Bob, if he presents Alice’s secret.
pt: Bob, se ele apresentar o segredo da Alice.
ru: Бобом, если он предоставит "секрет" Алисы.

source: If Alice tries to rob him by droping an old channel state, he doesn’t need to have Carol’s secret to unlock the bitcoin.
pt: Se a Alice tentar frauda-lo transmitindo um estado antigo do canal, ele não precisará nem ter o segredo da Carol para destrancar o bitcoin.
ru: Если Алиса попытается ограбить его, опубликовав старое состояние канала, ему не нужно иметь "секрет" Кэрол, чтобы разблокировать биткоин.

source: Again, each of them signs their half-valid transaction and gives it to the other.
pt: Novamente, cada um deles assina a sua transação semi-válida e a entrega ao outro.
ru: И снова каждый из них подписывает свои полу-действительные транзакции и передают их друг другу.

source: Current state of things
pt: Estado atual das coisas
ru: Текущее положение дел

source: So this is what will happen next if one of them drops this current channel state on the blockchain:
pt: Isto é o que irá ocorrer se um deles transmitir o estado atual do canal para a blockchain:
ru: Вот что произойдет если кто-то из них опубликует текущее состояние канала в блокчейне:

source: Alice drops the channel:
pt: Alice transmite o canal:
ru: Алиса публикует состояние канала:

source: Bob gets 3 bitcoins immediately.
pt: Bob recebe 3 btc imediatamente.
ru: Боб получает 3 биткоина немедленно.

source: Alice gets 4 bitcoins in 1000 blocks.
pt: Alice recebe 4 bitcoins após 1000 blocos.
ru: Алиса получит 4 биткоина через 1000 блоков.

# ./understanding-the-lightning-network-part-3/source-text.txt:98
source: Bob has 2 weeks to present Carol’s secret and retrieve the remaining bitcoin. If he doesn’t, Alice can take it back to herself.
pt: Bob tem 2 semanas para apresentar o segredo da Carol e recuperar o bitcoin restante. Se ele não o fizer, Alice pode pega-lo de volta.
ru: У боба есть 2 недели чтобы предоставить "секрет" Кэрол" и забрать оставшийся биткоин, в противном случае его вернёт себе Алиса.

source: Bob drops the channel:
pt: Bob transmite o canal:
ru: Боб публикует состояние канала:

source: Alice gets 4 bitcoins immediately.
pt: Alice recebe 4 btc imediatamente.
ru: Алиса получает 4 биткоина немедленно.

source: Bob gets 3 bitcoins in 1000 blocks.
pt: Bob recebe 3 btc após 1000 blocos.
ru: Боб получит 3 биткоина через 1000 блоков.

# ./understanding-the-lightning-network-part-3/source-text.txt:112
source: Bob has 2 weeks to present Carol’s secret and retrieve the remaining bitcoin. If he doesn’t, Alice can take it back to herself.
pt: Bob tem 2 semanas para apresentar o segredo da Carol e recuperar o bitcoin restante. Se ele não o fizer, Alice pode pega-lo de volta.
ru: У боба есть 2 недели чтобы предоставить "секрет" Кэрол" и забрать оставшийся биткоин, в противном случае его вернёт себе Алиса.

source: And if any of them tries to broadcast this state when it’s already outdated, the other can “steal” all the bitcoins.
pt: E, se qualquer um deles tentar transmitir este estado do canal quando estiver ultrapassado, o outro pode “roubar” todos os bitcoins.
ru: И если кто-то из них опубликует старую неактуальную транзакцию, другая сторона сможет "украсть" все биткоины.

source: The updating agreement
pt: O acordo de atualização
ru: Обновление соглашения

source: Both Alice and Bob know that Bob will have the HTLC bitcoin if he has Carol’s secret. So, in order to keep the channel open and simplify things, they can agree to update the balance with new commitment transactions as follows:
pt: Ambos Alice e Bob sabem que Bob terá o bitcoin do HTLC se ele tiver o segredo da Carol. Logo, para manter o canal aberto e simplificar as coisas, eles podem concordar na atualização do saldo do canal com novas transações de compromisso:
ru: Если Боб покажет Алисе "секрет" Кэрол, то они оба знают, что Боб может получить этот HTLC биткоин. Поэтому чтобы оставить канал открытым и для упрощения они соглашаются обновить баланс канала новыми транзакциями-состояния:

source: Alice’s new commitment
pt: Nova transação de compromisso da Alice
ru: Новая транзакция-состояния Алисы

# ./understanding-the-lightning-network-part-3/source-text.txt:124
source: 4 bitcoins to herself.
pt: 4 bitcoins para si própria.
ru: 4 биткоина себе.

# ./understanding-the-lightning-network-part-3/source-text.txt:128
source: to Alice’s key
pt: p/ a chave da Alice
ru: ключ Алисы

# ./understanding-the-lightning-network-part-3/source-text.txt:130
source: 4 bitcoins to a multisig address that can be unlocked by:
pt: 4 bitcoins para um endereço multi-assinatura que pode ser destrancado por:
ru: 4 биткоина на адрес с мультиподписью который может разблокирован:

# ./understanding-the-lightning-network-part-3/source-text.txt:134
source: Bob, after 1000 blocks.
pt: Bob, após 1000 blocos.
ru: Бобом после 1000 блоков.

# ./understanding-the-lightning-network-part-3/source-text.txt:136
source: Alice, if she presents Bob’s secret.
pt: Alice, se ela apresentar o segredo do Bob.
ru: Алисой, если предоставит "секрет" Боба.

source: Bob’s new commitment
pt: Nova transação de compromisso do Bob
ru: Новая транзакция-состояния Боба

source: 4 bitcoins to himself.
pt: 4 bitcoins para si próprio.
ru: 4 биткоина себе.

# ./understanding-the-lightning-network-part-3/source-text.txt:144
source: to Bob’s key
pt: p/ a chave do Bob
ru: ключ Боба

# ./understanding-the-lightning-network-part-3/source-text.txt:146
source: 4 bitcoins to a multisig address that can be unlocked by:
pt: 4 bitcoins para um endereço multi-assinatura que pode ser destrancado por:
ru: 4 биткоина на адрес с мультиподписью который может разблокирован:

# ./understanding-the-lightning-network-part-3/source-text.txt:150
source: Alice, after 1000 blocks.
pt: Alice, após 1000 blocos.
ru: Алисой после 1000 блоков.

# ./understanding-the-lightning-network-part-3/source-text.txt:152
source: Bob, if he presents Alice’s secret.
pt: Bob, se ele apresentar o segredo da Alice.
ru: Бобом, если он предоставит "секрет" Алисы.

source: Closing the channel
pt: Fechando o canal
ru: Закрытие канала

source: To finally close the channel, Alice and Bob will create and broadcast a transaction directly from the opening transaction with the final balance, i.e., the most recent channel state.
pt: Para finalmente fechar o canal, Alice e Bob vão criar e transmitir uma transação diretamente da transação de abertura que reflita o saldo final, isto é, o estado mais recente do canal.
ru: Чтобы окончательно закрыть канал, Алиса и Боб непосредственно из открывающей транзакции создают и публикуют транзакцию с актуальным балансом, соответствющему самому последнему состоянию канала.

source: 4 bitcoins to Bob.
pt: 4 bitcoins para Bob.
ru: 4 биткоина Бобу.

source: 4 bitcoins to Alice.
pt: 4 bitcoins para Alice.
ru: 4 биткоина Алисе.

source: This means that only 2 transactions actually got to be written on the blockchain: the opening and the closing transaction.
pt: Isto significa que apenas 2 transações foram realmente escritas na blockchain: a de abertura de a de fechamento.
ru: Это значит, что в блокчейне в итоге будут записаны всего две транзакции: открывающая транзакция и закрывающая.

source: Off-chain transactions
pt: Transações fora da blockchain
ru: Транзакции вне блокчейна

source: Opening transaction
pt: Transação de abertura
ru: Открывающая транзакция

source: Closing transaction
pt: Transação de fechamento
ru: Закрывающая транзакция

source: It works the same no matter how many times they transacted with the channel open.
pt: Funciona desta mesma forma não importa quantas vezes eles transacionaram com o canal aberto.
ru: И тут совершенно не имеет значения как много транзакций было совершено внутри открытого канала.

source: That’s why the lightning network is such a huge step to reduce the overload of transactions on the blockchain; and, therefore, improve Bitcoin’s scalability.
pt: Por isso, a Lightning Network é um avanço tão grande para reduzir a sobrecarga de transações na blockchain e, portanto, ela melhora a escalabilidade do Bitcoin.
ru: Вот почему Lightning Network это огромный шаг в решении проблемы масштабируемости Биткоина путем снижения нагрузки на блокчейн.

source: POWERED BY
pt: ALIMENTADO POR

source: Off-chain
pt: Fora da blockchain
ru: Вне блокчейна

source: On-chain
pt: Na blockchain
ru: В блокчейне

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão
ru: Автор: Patrícia Estevão

source: Main resources: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-completing-the-puzzle-and-closing-the-channel-1466178980/
pt: Principais fontes: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-completing-the-puzzle-and-closing-the-channel-1466178980/
ru: Основной источник: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-completing-the-puzzle-and-closing-the-channel-1466178980/

source: Editor: Marco Agner
ru: Редактор: Marco Agner
