Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: what-does-censorship-resistance-means-*-bitcoin/*.po
Languages: pt

source: What does Censorship resistance mean in Bitcoin?
pt: O que a Resistência à Censura significa no Bitcoin?

source: You’ve probably heard a bitcoiner talk about Bitcoin’s censorship resistance, but what does it really mean?
pt: Você provavelmente já ouviu alguém falar de resistência à censura no Bitcoin, mas o que isto significa de verdade?

source: Well, it means that Bitcoin transactions can’t be censored. That was easy, right?
pt: Bem, significa que transações de Bitcoin não podem ser censuradas. Foi fácil, né?

source: Free Bitcoin
pt: Bitcoin Livre

source: But isn’t censorship usually about suppressing free speech or information? What does money have to do with that?
pt: Mas censura não é, normalmente, relacionada à opressão da liberdade de discurso ou informação? O que dinheiro tem a ver com isso?

source: The way you spend your money is an expression of yourself (your values, habits, etc). Money is actually a form of speech.
pt: A forma que você gasta seu dinheiro é uma expressão de si próprio (seus valores, hábitos, etc). Dinheiro é uma forma de discurso.

source: Here’s a traditional system simulation:
pt: Veja esta simulação do sistema tradicional:

source: Let’s say you want to support an NGO that has a particular ideology.
pt: Vamos dizer que você quer apoiar uma ONG que tem uma ideologia específica.

source: The government from your country decides it doesn’t approve that ideology.
pt: O governo do seu país decide que não aprova a ideologia em questão.

source: An official statement tells financial institutions that they shouldn’t allow transactions to the NGO.
pt: Um comunicado oficial recomenda que instituições financeiras não aceitem transações para a ONG.

source: The institutions oblige and you are blocked from spending money in a cause you believe in.
pt: As instituições obedecem e você fica impedido de gastar seu dinheiro em uma causa em que você acredita.

source: You’re actually being
pt: Você está, de fato, sendo

source: censored
pt: censurado

source: This can happen in other circumstances that don’t involve much ideology, such as wanting to buy prohibited drugs.
pt: Isto também ocorre em circunstâncias que não envolvem muita ideologia, como quando alguém quer comprar drogas ilegais.

source: In Bitcoin, as long as the network is decentralized, nodes will relay your transaction and miners will compete to add your transaction to the blockchain.
pt: No Bitcoin, enquanto a rede for descentralizada, os nós irão transmitir a sua transação e os mineradores irão competir para adicionar-la na blockchain.

source: It might not be a very glamorous definition, but Bitcoin’s censorship resistance is ultimately about being able to
pt: Pode não ser uma definição muito glamurosa, mas a resistência à censura no Bitcoin se resume, essencialmente, em

source: spend your money on whatever you want.
pt: gastar o seu dinheiro no que você quiser.

source: And that isn’t just something that was added by an incident to Bitcoin.
pt: E isto não foi uma característica adicionada sem querer no Bitcoin.

source: It’s one of the reasons it was created in the first place.
pt: É uma das razões porque ele foi criado em primeiro lugar.

source: Free money
pt: Dinheiro livre

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão
