Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: why-build-the-lightning-network/*.po
Languages: pt

source: Why build the Lightning Network?
pt: Por que construir a Lightning Network?

source: What is the big idea?
pt: Qual é a ideia geral?

source: The lightning network is a scaling approach to Bitcoin.
pt: A Lightning Network é uma abordagem para escalar o Bitcoin.

source: It’s really about moving a lot of Bitcoin transactions out of the blockchain and into private channels between users, but still counting on the blockchain’s security.
pt: O ponto principal é que se movam muitas transações para fora da blockchain e para dentro de canais privados entre usuários, sem deixar de contar com a segurança da blockchain.

source: Off-chain transactions
pt: Transações fora da blockchain

source: It’s like a contract and arbitration system (with a poetic license, of course):
pt: É como se fosse um sistema de arbitragem e contratos (com uma licença poética):

source: Imagine you want to make a deal with someone and, for that, you create a contract and register it with a notary.
pt: Imagine que você quer fazer um acordo com alguém e, para isso, você cria um contrato e registra em cartório.

source: That’s you opening a lightning network channel with someone.
pt: Isto é você abrindo um canal da Lightning Network com alguém.

source: You expect to do this deal without any hassles, with both parties fulfilling their duties. But, anyway, you have a contract to protect yourself.
pt: Você espera completar o acordo sem nenhum problema, com ambos cumprindo suas obrigações. Mas, de qualquer forma, você cria o contrato para se proteger.

source: You create commitment transactions that are not really broadcast, unless necessary to resolve a dispute.
pt: Você cria transações de compromisso que não serão transmitidas, a não ser que seja necessário resolver uma disputa.

source: If one of you breaks the agreement, you can take this contract to a court that will recognize it as valid and give gain to the honest party.
pt: Se um de vocês quebrar o acordo, o contrato poderá ser levado a uma corte, que o reconhecerá como válido e dará a causa à parte honesta.

source: If someone tries to rob you (broadcasting an old channel state), you can take the contract to the blockchain and get all the bitcoins in the channel. Only, in this case, there’s no subjectivity in interpreting the contract.
pt: Se alguém tentar lhe roubar (transmitindo um estado antigo do canal), você pode levar o contrato à blockchain e pegar todos os bitcoins do canal. A diferença é que, neste caso, não há subjetividade na interpretação do contrato.

source: In practice, most people don’t ever need to go to a court because nobody broke their contract, so the arbitration system doesn’t get bloated.
pt: Na prática, a maioria das pessoas não precisará ir a uma corte porque ninguém terá quebrado o contrato, então o sistema de arbitragem não fica sobrecarregado.

source: Countless transactions can occur in private and off-chain while a channel is open and both parties are being honest, therefore, unburdening the blockchain.
pt: Inúmeras transações podem ocorrer fora da blockchain enquanto o canal está aberto e ambas as partes estão sendo honestas e, portanto, consegue-se desafogar a blockchain.

source: If using the lightning network, only 3 types of transactions need to be broadcast to the blockchain:
pt: Se estivermos usando a Lightning Network, apenas 3 tipos de transação precisam ser transmitidas à blockchain:

source: The transaction that opens a channel.
pt: A transação que abre um canal.

source: The transaction that closes a channel.
pt: A transação que fecha um canal.

source: Disputes that need to be settled.
pt: Disputas que precisem ser resolvidas.

source: The big features
pt: As características mais importantes

source: Fast and cheap
pt: Rápida e barata

source: Now you can actually get instant and almost free payments since you can mainly transact without the limitations of writing on the blockchain. Which means micro-payments are now totally viable!
pt: É possível ter transações instantâneas e quase de graça, já que muitos pagamentos serão feitos sem a preocupação com os limites de escrita na blockchain. Micro-pagamentos são, agora, perfeitamente viáveis!

source: Practical
pt: Prática

source: You only have to open a few channels to be able to transact with the whole network because channels are interconnected.
pt: Apenas alguns canais precisarão ser abertos para que você possa transacionar com toda a rede, pois os canais são interconectados.

source: No expiration date
pt: Sem prazo de validade

source: Channels can stay open indefinitely, maximizing the unburdening effect on the blockchain and dissolving the fees for the opening and closing transactions of a channel.
pt: Canais podem permanecer abertos indefinidamente, maximizando o desaforamento da blockchain e dissolvendo as taxas das transações de abertura e fechamento de um canal.

source: OPEN 24/7
pt: ABERTO 24/7

source: Improved privacy
pt: Melhora na privacidade

source: It can use encryption and intermediary nodes that relay transactions without knowing its origin and destiny (onion-style routing).
pt: Você pode usar criptografia e nós intermediários que transmitem transações sem saber a origem ou o destino (roteamento cebola).

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão

source: Sources: https://en.bitcoin.it/wiki/Lightning_Network
pt: Fontes: https://en.bitcoin.it/wiki/Lightning_Network

source: The court analogy was described in reddit a while ago, I just couldn’t find a link to it. If someone finds it, please send it to me. :)
pt: A analogia da corte foi descrita no reddit há um tempo atrás, mas não consegui achar um link para ela. Se alguém encontrar, por favor me envie. :)
