Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: understanding-the-lightning-network-part-1/*.po
Languages: pt, ru

source: Understanding the Lightning Network - Part 1:
pt: Entendendo a Lightning Network - Parte 1:
ru: Принцип работы Lightning Network - Часть 1:

source: Payment Channels
pt: Canais de Pagamento
ru: Платежные каналы

source: Payment channels are one of the main elements playing a role in the Lightning network, so let’s take a look at how they works.
pt: Canais de pagamento são um dos principais elementos que compõe a Lightning Network, então vamos dar uma olhada em como eles funcionam.
ru: Платежные каналы являются одним из ключевых элементов в Lightning Network, поэтому давайте посмотрим, как они работают.

source: What is a payment channel?
pt: O que é um canal de pagamento?
ru: Что такое платежный канал?

source: It’s a manner to make a series of transactions “off-chain”, i.e. without actually relaying them to the blockchain, but still benefitting from the “on-chain” security.
pt: É uma forma de fazer várias transações fora da blockchain, i.e. sem transmiti-las para a blockchain, mas ainda assim se beneficiando da segurança da blockchain.
ru: Это способ сделать серию транзакций “off-chain”, т.е. транзакции не записываются в блокчейн, но при этом они продолжают получать преимущества безопасности, обеспечиваемой блокчейном.

source: That allows a huge number of really fast and almost free transactions to be made through the channel, because you don’t need to settle each of them on the blockchain.
pt: Isto permite que um número enorme de transações super rápidas e quase de graça sejam feitas pelo canal porque você não precisa escrever cada uma na blockchain.
ru: И раз нам не нужно каждую транзакцию записывать в блокчейн это позволяет провести огромное количество действительно быстрых и почти бесплатных транзакций в каналах.

source: For the Lightning Network, we need bidirectional payment channels, which means that both parties that start a channel have to be able to send bitcoins.
pt: Para a Lightning Network, nós precisamos de canais de pagamento bidirecionais, o que significa que ambas as partes que participam do canal devem poder enviar bitcoins.
ru: Для Lightning Network нам нужны двунаправленные платежные каналы, когда обе стороны открывшие канал имеют возможность его использовать для отправки своих биткоинов.

source: And, of course, this channel has to work trustlessly, so the parties don’t need to trust each other to agree with beginning transacting.
pt: E, é claro, este canal não pode depender de confiança, para que as partes não precisem se confiar antes de concordar com o início das transações.
ru: И, конечно же, такой канал при его использовании должен работать без необходимости сторонам доверять друг другу.

source: Opening a channel
pt: Abrindo um canal
ru: Открытие канала

source: Alice needs to send 1 btc to Bob. Since they know they are going to do a lot of transactions in the near future, they decide to use a lightning network channel to make things faster and cheaper. They will start a channel with a 4 bitcoins deposit by creating an opening transaction.
pt: Alice precisa enviar 1 btw a Bob. Como sabem que vão transacionar várias vezes no futuro próximo, eles decidem usar um canal da Lightning Network para tornar as coisas mais rápidas e baratas. Eles farão uma transação de abertura e começarão um canal com um depósito de 4 bitcoins.
ru: Алисе нужно отправить 1 BTC Бобу. В ближайшем будущем они собираются совершить много транзакций, и чтобы в дальнейшем это было быстрее и дешевле, они решили использовать канал Lightning Network. Они открывают канал с депозитом в 4 биткоина создавая открывающую транзакцию.

# ./understanding-the-lightning-network-part-1/source-text.txt:24
source: Step-by-step
pt: Passo-a-passo
ru: Рассмотрим пошагово

source: Each of them sends 4 bitcoins to a multisig address that needs both their keys to sign a valid spending transaction.
pt: Cada um envia 4 bitcoins a um endereço multi-assinatura (multisig) que precisa de ambas as chaves para assinar uma transação de gasto válida.
ru: Каждый из них отправляет 4 биткоина на адрес с мультиподписью требующий оба их ключа для подписания транзакций, тратящих эти биткоины.

# ./understanding-the-lightning-network-part-1/source-text.txt:28
source: Opening transaction
pt: Transação de Abertura
ru: Открывающая транзакция

# ./understanding-the-lightning-network-part-1/source-text.txt:30
source: multisig
ru: мультиподпись

source: from Bob
pt: de Bob
ru: от Боба

source: from Alice
pt: de Alice
ru: от Алисы

source: They create a secret (string of numbers) and a hash of the secret, and exchange the hash with the other.
pt: Eles criam um segredo (uma sequência de números), tiram o hash do segredo e trocam o hash um com o outro.
ru: Они создают "секрет" (строку чисел) и хеш "секрета", и обмениваются хешем друг с другим.

source: Bob’s secret hash
pt: Hash do segredo do Bob
ru: Хэш "секрета" Боба

source: Alice’s secret hash
pt: Hash do segredo da Alice
ru: Хэш "секрета" Алисы

source: Remember, the first transaction we want to make is the 1 bitcoin that Alice has to give Bob.
pt: Lembrando que a primeira transação que queremos fazer é enviar 1 bitcoin da Alice para o Bob.
ru: Как мы помним самой первой транзакцией мы хотим отправить 1 биткоин от Алисы Бобу.

source: Alice creates a commitment transaction from the opening transaction sending 3 bitcoins to herself and 5 to a new multisig address.
pt: Alice cria uma transação de compromisso a partir da transação de abertura enviando 3 bitcoins para ela mesma e 5 para um novo endereço multi-assinatura.
ru: Алиса создает транзакцию-состояния из открывающей транзакции, отправляя 3 BTC себе и 5 BTC на новый адрес с мультиподписью.

source: Alice’s first commitment transaction
pt: Primeira transação de compromisso da Alice
ru: Первая транзакция-состояния Алисы

# ./understanding-the-lightning-network-part-1/source-text.txt:52
source: 1st condition
pt: 1ª condição
ru: 1-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:54
source: Alice
ru: Алиса

# ./understanding-the-lightning-network-part-1/source-text.txt:58
source: 2nd condition
pt: 2ª condição
ru: 2-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:60
source: multisig
pt: multisignificativo
ru: мультиподпись

# ./understanding-the-lightning-network-part-1/source-text.txt:64
source: This new multisig address can be unlocked by:
pt: Este novo endereço multi-assinatura pode ser destrancado por:
ru: Этот новый адрес с мультиподписью может быть разблокирован:

source: Bob, only after 1000 extra blocks are mined (this condition has a time lock called CheckSequenceVerify).
pt: Bob, após 1000 novos blocos serem minerados (esta condição tem uma tranca temporal chamada CheckSequenceVerify).
ru: Бобом только после того как будут дополнительно смайнены 1000 блоков (это условие обеспечивается таймлоком CheckSequenceVerify или CSV).

source: Alice, if she presents the secret for which Bob gave her the hash previously (having only the hash will not work so, for now, she can’t unlock the transaction).
pt: Alice, se ela apresentar o segredo para o qual Bob deu a ela o hash anteriormente (ter apenas o hash não funciona então, por enquanto, ela não consegue destrancar a transação).
ru: Алисой, если она предоставит "секрет" Боба хеш которого он дал ей ранее (иметь только хеш не достаточно, поэтому она сейчас не может разблокировать транзакцию).

# ./understanding-the-lightning-network-part-1/source-text.txt:70
source: multisig
pt: multisignificativo
ru: мультиподпись

# ./understanding-the-lightning-network-part-1/source-text.txt:74
source: to Bob’s key + 1000 block wait
pt: p/ a chave de Bob + 1000 blocos de espera
ru: ключ Боба + ожидание 1000 блоков

# ./understanding-the-lightning-network-part-1/source-text.txt:78
source: to Alice’s key + Bob’s secret
pt: p/ a chave de Alice + Segredo de Bob
ru: ключ Алисы + "секрет" Боба

source: Alice signs the commitment transaction and gives the half-valid transaction (needs Bob signature to be valid) to Bob.
pt: Alice assina a transação de compromisso e entrega a transação semi-válida (precisa da assinatura do Bob para ficar válida) ao Bob.
ru: Алиса подписывает транзакцию-состояния и передает "наполовину" действительную (так как необходима еще подпись Боба) транзакцию Бобу.

source: Bob also creates a half-valid transaction with his signature sending 5 btcs to himself and 3 to a new multisig address and gives it to Alice.
pt: Bob também cria uma transação semi-válida com a assinatura dele enviando 5 btcs a si próprio e 3 para um novo endereço multi-assinatura, e a entrega a Alice.
ru: Боб тоже создает и подписывает похожую полу-действительную транзакцию, отправляющую 5 BTC себе и 3 BTC на новый адрес с мультиподписью и отдает её Алисе.

source: Bob’s first commitment transaction
pt: Primeira transação de compromisso do Bob
ru: Первая транзакция-состояния Боба

# ./understanding-the-lightning-network-part-1/source-text.txt:86
source: 1st condition
pt: 1ª condição
ru: 1-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:88
source: Bob
ru: Боб

# ./understanding-the-lightning-network-part-1/source-text.txt:92
source: 2nd condition
pt: 2ª condição
ru: 2-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:94
source: multisig
pt: multisignificativo
ru: мультиподпись

# ./understanding-the-lightning-network-part-1/source-text.txt:98
source: This new multisig address can be unlocked by:
pt: Este novo endereço multi-assinatura pode ser destrancado por:
ru: Этот новый адрес с мультиподписью может быть разблокирован:

source: Alice, after waiting 1000 new blocks being mined.
pt: Alice, após 1000 novos blocos serem minerados.
ru: Алисой только после того как будут дополнительно смайнены 1000 блоков.

source: Bob, if presenting Alice’s secret.
pt: Bob, se apresentar o segredo de Alice.
ru: Бобом, если он предоставит "секрет" Алисы.

# ./understanding-the-lightning-network-part-1/source-text.txt:104
source: multisig
ru: мультиподпись

# ./understanding-the-lightning-network-part-1/source-text.txt:108
source: to Alice’s key + 1000 block wait
pt: p/ a chave de Alice + 1000 blocos de espera
ru: ключ Алисы + ожидание 1000 блоков

# ./understanding-the-lightning-network-part-1/source-text.txt:110
source: to Bob’s key + Alice’s secret
pt: p/ a chave de Bob + segredo de Alice
ru: ключ Боба + "секрет" Алисы

source: After the exchange of the half-valid transactions, the opening transaction is broadcast and recorded on the blockchain. The channel is officially open.
pt: Após a troca das transações semi-válidas, a transação de abertura é transmitida e gravada na blockchain. O canal está oficialmente aberto.
ru: После того как они обменялись транзакциями-состояния, в сеть публикуется открывающая транзакция и после записи её в блокчейн - канал открыт.

# ./understanding-the-lightning-network-part-1/source-text.txt:114
source: Opening transaction
pt: Transação de abertura
ru: Открывающая транзакция

source: Updating a channel
pt: Atualizando um canal
ru: Обновление канала

source: Now, Bob has to give 2 bitcoins to Alice, so they need to update the channel state with new commitment transactions that will reflect the new balance.
pt: Agora, Bob tem que dar 2 bitcoins a Alice. Logo, eles precisam atualizar o estado do canal com novas transações de compromisso que refletirão o novo saldo.
ru: Теперь Бобу нужно отдать 2 биткоина Алисе, для этого им нужно обновить состояние канала новыми транзакциями-состояния, отражающими актуальный баланс канала.

# ./understanding-the-lightning-network-part-1/source-text.txt:120
source: Step-by-step
pt: Passo-a-passo
ru: Рассмотрим пошагово

source: New secrets are created and their hashes exchanged. They will be used for this next commitment transaction.
pt: Novos segredos são criados e os seus hashes trocados. Eles serão usados para esta próxima transação de compromisso.
ru: Они создают новые "секреты" и обмениваются их хешами, которые будут использованы для новых транзакций-состояния.

source: Bob’s secret
pt: Segredo de Bob
ru: "секрет" Боба

# ./understanding-the-lightning-network-part-1/source-text.txt:126
source: hash
ru: хеш

source: Alice’s secret
pt: Segredo de Alice
ru: "секрет" Алисы

# ./understanding-the-lightning-network-part-1/source-text.txt:130
source: hash
ru: хеш

source: Alice creates a commitment transaction sending 5 btc to herself and 3 btc to a new multisig address that has the same unlocking conditions as before, signs and gives it to Bob.
pt: Alice cria uma transação de compromisso enviando 5 btc a si própria e 3 btc para um novo endereço multi-assinatura que terá as mesmas condições de destrancamento de antes, a assina e entrega ao Bob.
ru: Алиса создает транзакцию-состояния, отправляя 5 BTC себе и 3 BTC на новый адрес с мультиподписью, имеющий те же условия разблокировки что и ранее, подписывает её и отдает Бобу.

source: Alice’s second commitment transaction
pt: Segunda transação de compromisso de Alice
ru: Вторая транзакция-состояния Алисы

# ./understanding-the-lightning-network-part-1/source-text.txt:136
source: 1st condition
pt: 1ª condição
ru: 1-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:138
source: Alice
ru: Алиса

# ./understanding-the-lightning-network-part-1/source-text.txt:142
source: 2nd condition
pt: 2ª condição
ru: 2-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:144
source: multisig
ru: мультиподпись

# ./understanding-the-lightning-network-part-1/source-text.txt:148
source: to Bob’s key + 1000 block wait
pt: p/ a chave de Bob + 1000 blocos de espera
ru: ключ Боба + ожидание 1000 блоков

# ./understanding-the-lightning-network-part-1/source-text.txt:150
source: OR
pt: OU
ru: ИЛИ

# ./understanding-the-lightning-network-part-1/source-text.txt:152
source: to Alice’s key + Bob’s secret
pt: p/ a chave de Alice + Segredo de Bob
ru: ключ Алисы + "секрет" Боба

source: Bob creates a commitment transaction sending 3 btc to himself and 5 btc to the new multisig address with the same unlocking conditions as before, signs and gives it to Alice.
pt: Bob cria uma segunda transação de compromisso enviando 3 btw a si próprio e 5 para um novo endereço multi-assinatura com as mesmas condições de destrancamento de antes, a assina e entrega a Alice.
ru: Боб создает транзакцию-состояния, отправляя 3 BTC себе и 5 BTC на новый адрес с мультиподписью, имеющий те же условия разблокировки что и ранее, подписывает её и отдает Алисе.

source: Bob’s second commitment transaction
pt: Segunda transação de compromisso de Bob
ru: Вторая транзакция-состояния Боба

# ./understanding-the-lightning-network-part-1/source-text.txt:158
source: 1st condition
pt: 1ª condição
ru: 1-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:160
source: Bob
ru: Боб

# ./understanding-the-lightning-network-part-1/source-text.txt:164
source: 2nd condition
pt: 2ª condição
ru: 2-й выход

# ./understanding-the-lightning-network-part-1/source-text.txt:166
source: multisig
ru: мультиподпись

# ./understanding-the-lightning-network-part-1/source-text.txt:170
source: to Alice’s key + 1000 block wait
pt: p/ a chave de Alice + 1000 blocos de espera
ru: ключ Алисы + ожидание 1000 блоков

# ./understanding-the-lightning-network-part-1/source-text.txt:172
source: OR
pt: OU
ru: ИЛИ

# ./understanding-the-lightning-network-part-1/source-text.txt:174
source: to Bob’s key + Alice’s secret
pt: p/ a chave de Bob + segredo de Alice
ru: ключ Боба + "секрет" Алисы

source: Alice and Bob exchange their old secrets, used in the first commitment.
pt: Alice e Bob trocam os seus antigos segredos, usados nas primeiras transações de compromisso.
ru: Алиса и Боб обмениваются своими старыми "секретами", использованными в первой транзакции-состояния.

source: This process is repeated every time the balance needs to be updated.
pt: Este processo é repetido sempre que o saldo do canal precisa ser atualizado.
ru: Этот процесс повторяется каждый раз, когда необходимо обновить состояние баланса канала.

source: Incentives for a trustless system
pt: Incentivos para um sistema sem confiança
ru: Как же достигаются бездоверительные отношения

source: So now Bob has 2 commitment transactions, the first one giving him more money than the second. So why doesn’t he broadcast the first one now and scam Alice? Let’s see what would happen.
pt: Agora Bob tem 2 transações de compromisso consigo, a 1ª lhe dando mais dinheiro do que a 2ª. Então por que ele não transmite a 1ª agora e frauda a Alice? Vamos ver o que aconteceria.
ru: Теперь у Боба есть 2 транзакции-состояния, причем первая дает ему больше денег, чем вторая. Так почему бы не обмануть Алису и опубликовать первую? Давайте посмотрим что произойдет.

# ./understanding-the-lightning-network-part-1/source-text.txt:184
source: Step-by-step
pt: Passo-a-passo
ru: Рассмотрим пошагово

source: Bob signs and broadcasts the half-valid transaction that Alice first sent him.
pt: Bob assina e transmite a primeira transação semi-válida que Alice o enviara.
ru: Боб подписывает и публикует первую транзакцию-состояния полученную от Алисы.

source: Alice will get 3 btc (her balance at the time of the commitment) immediately.
pt: Alice receberá 3 btc (o saldo dela quando foi feito este compromisso) imediatamente.
ru: Алиса получает 3 BTC (её баланс на момент первого состояния канала) немедленно.

source: The other 5 btc will go to the address that Bob can only unlock after 1000 blocks.
pt: Os outros 5 btc irão para o endereço que Bob só pode destrancar após 1000 blocos.
ru: Оставшиеся 5 BTC отправляются на адрес который Боб сможет разблокировать только через 1000 блоков.

source: Bob’s key + 1000 block wait
pt: P/ a chave de Bob + 1000 blocos de espera
ru: Ключ Боба + ожидание 1000 блоков

source: But now Alice has Bob’s secret from that commitment, so she can access the multisig address before Bob (she doesn’t have to wait 1000 blocks) and get all the bitcoins to herself.
pt: Mas, agora, Alice possui o segredo de Bob referente a este compromisso, então ela pode acessar o endereço multisig antes de Bob (ela não precisa aguardar os 1000 blocos) e pegar todos os bitcoins para si.
ru: Но сейчас у Алисы есть "секрет" Боба от первого состояния, поэтому она может получить доступ к адресу с мультиподписью раньше Боба (ей не нужно ждать 1000 блоков) и забрать все биткоины себе.

# ./understanding-the-lightning-network-part-1/source-text.txt:196
source: to Alice’s key + Bob’s secret
pt: p/ a chave de Alice + Segredo de Bob
ru: ключ Алисы + "секрет" Боба

source: Bob’s attempt to defraud Alice has just backfired!
pt: A tentativa do Bob de fraudar Alice saiu pela culatra!
ru: Попытка Боба обмануть Алису провалилась!

source: The same will happen if Alice is the one trying to broadcast an old commitment. This way, both parties are strongly incentivized to respect the most recent state of the channel.
pt: O mesmo aconteceria se fosse a Alice tentando transmitir uma transação de compromisso antiga. Desta forma, ambas as partes têm fortes incentivos para respeitar o estado atual do canal.
ru: То же самое произойдет если Алиса попытается опубликовать старое состояние. Таким образом у обеих сторон есть сильная заинтересованность следовать правилам и при необходимости публиковать только актуальное состояние канала.

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão
ru: Автор: Patrícia Estevão

source: Editor: Marco Agner
ru: Редактор: Marco Agner

source: Main resources: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-building-a-bidirectional-payment-channel-1464710791/
pt: Principais fontes: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-building-a-bidirectional-payment-channel-1464710791/
ru: Основной источник: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-building-a-bidirectional-payment-channel-1464710791/

# ./understanding-the-lightning-network-part-1/source-text.txt:76
source: OR
pt: OU
