Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: what-are-the-bitcoin-timelocks/*.po
Languages: pt, ru

source: The Lightning network basics series
pt: Os Fundamentos da Lightning Network
ru: Основы Lightning Network

source: What are the Bitcoin Timelocks?
pt: O que são as trancas temporais do Bitcoin (Timelocks)?
ru: Что такое Таймлок (Timelock)?

source: A time lock is a type of smart contract primitive that restricts the spending of bitcoins until a specified time in the future.
pt: Uma tranca temporal é um tipo de contrato inteligente que restringe o gasto de bitcoins até um determinado momento no futuro.
ru: Таймлок (блокировка по времени) это смарт-контракт, который блокирует возможность траты биткоинов до определенного времени в будущем.

source: Types of timelocks
pt: Tipos de trancas temporais
ru: Разновидности таймлоков

source: It’s a transaction field.
pt: É um campo da transação.
ru: Это параметр транзакции.

source: It’s an opcode (code used in Bitcoin’s script language).
pt: É um opcode (código usado na linguagem Script do Bitcoin).
ru: Это опкод (код используемый в скриптовом языке Биткоина).

source: Specifies the earliest time or the lowest block height a transaction may be added to a valid block.
pt: Especifica o momento mais cedo ou a altura de bloco mais baixa que uma transação pode ser adicionada a um bloco válido.
ru: Устанавливает самое раннее время или наименьшую высоту блока, после которого транзакция может быть добавлена в блокчейн.

source: Locks transaction’s outputs so they can’t be spent before a specified time/date.
pt: Tranca os outputs da transação para que eles não possam ser gastos antes de um tempo/data específico.
ru: Блокируются выводы транзакции, которые не могут быть потрачены до установленного времени/даты.

source: Locks transaction’s outputs so they can’t be spent before a specified number of blocks has been mined.
pt: Tranca os outputs da transação para que eles não possam ser gastos antes de um número específico de blocos ser minerado.
ru: Блокируются выводы транзакции, которые не могут быть потрачены до того, как будет смайнено указанное количество блоков.

source: Absolute time lock: you choose an specific time (UNIX date or block height) as your unlocking parameter.
pt: Tranca temporal absoluta: você escolhe um tempo específico (data UNIX ou altura de bloco) como parâmetro de destracamento.
ru: Абсолютная блокировка: в качестве условия разблокировки вы устанавливаете определенное время (в UNIX формате или высоту блока).

source: Relative time lock: you choose a number of future blocks that need to be created as your unlocking parameter.
pt: Tranca temporal relativa: você escolhe um número de blocos futuros que precisam ser criados como parâmetro de destracamento.
ru: Относительная блокировка: в качестве параметра разблокировки вы устанавливаете количество блоков, которые должны быть добавлены в блокчейн после того как будет смайнена данная транзакция.

source: If broadcast to the network before the specified time, the transaction will be considered invalid.
pt: Se transmitida à rede antes do tempo especificado, a transação será considerada inválida.
ru: Если опубликовать данную транзакцию в сети до указанного времени она будет считаться недействительной.

source: The transaction is valid and marked on the blockchain from the start, even though the money is locked.
pt: A transação é válida e escrita na blockchain desde o início, ainda que o dinheiro esteja trancado.
ru: Данная транзакция изначально считается действительной и записывается в блокчейн, не смотря на то что средства будут заблокированы.

source: If the outputs are used as inputs of a new transaction (i.e. if someone tried to spend them) before the unlock time, this new transaction will be invalid.
pt: Se os outputs forem usados como inputs de uma nova transação (ou seja, se alguém tentar gastá-los) antes do tempo de destracamento, esta nova transação será inválida.
ru: Однако если до того, как истечет время блокировки выходы такой транзакции будут использованы в качестве входов новой транзакции (т.е. кто-то попытается потратить их), то эта новая транзакция будет недействительна.

source: Example
pt: Exemplo
ru: Пример

source: Alice is going to a retreat and creates a transaction sending 2 btc to Bob so he can pay a bill for her while she is away. But she only wants it to be used in case she doesn’t come back in 10 days.
pt: Alice vai a um retiro e cria uma transação enviando 2 btc ao Bob para que ele possa pagar uma conta para ela enquanto ela está fora. Mas ela só quer que isto seja usado no caso de ela não voltar em 10 dias.
ru: Алисе нужно уехать на какое-то время, и чтобы Боб заплатил за неё счет, она создает транзакцию отправляющую ему 2 BTC. Но она хочет, чтобы их можно было потратить только если она не вернется в течении 10 дней.

source: Alice creates a transaction of 2 btc to Bob with a nLockTime set to 864000 seconds (10 days) from now.
pt: Alice cria uma transação de 2 btc para Bob com um nLockTime ajustado para 864000 segundos (10 dias) a partir de agora.
ru: Алиса создает транзакцию, отправляющую 2 BTC Бобу с параметром nLockTime равным 864000 секунд (10 дней) от текущей даты.

source: Alice creates a transaction of 2 btc to Bob with a CLTV set to 864000 seconds (10 days) from now.
pt: Alice cria uma transação de 2 btc para Bob com um CLTV ajustado para 864000 segundos (10 dias) a partir de agora.
ru: Алиса создает транзакцию, отправляющую 2 BTC Бобу с параметром CLTV равным 864000 секунд (10 дней) от текущей даты.

source: Alice creates a transaction of 2 btc to Bob with a CSV set to 1440 blocks after the transaction is mined (approximately 10 days).
pt: Alice cria uma transação de 2 btc para Bob com um CSV ajustado para 1440 blocos após a transação ser minerada (aproximadamente 10 dias).
ru: Алиса создает транзакцию, отправляющую 2 BTC Бобу с параметром CSV равным 1440 блоков (примерно 10 дней) с момента когда транзакция будет смайнена.

source: Alice gives the transaction to Bob.
pt: Alice dá a transação para Bob.
ru: Алиса дает эту транзакцию Бобу.

source: Alice broadcasts the transaction to the Bitcoin network.
pt: Alice transmite a transação para a rede Bitcoin.
ru: Алиса публикует эту транзакцию в сети Биткоина.

source: If Alice hasn’t returned in the mean time, Bob can broadcast the transaction after 10 days.
pt: Se Alice não retornar no meio tempo, Bob pode transmitir a transação após 10 dias.
ru: Если Алиса не вернется Боб сможет опубликовать транзакцию через 10 дней.

source: If Alice hasn’t returned in the mean time, Bob can spend the 2 btc after 10 days.
pt: Se Alice não retornar no meio tempo, Bob pode gastar os 2 btc após 10 dias.
ru: Если Алиса не вернется Боб сможет потратить 2 BTC через 10 дней.

source: If Alice hasn’t returned in the mean time, Bob can spend the 2 btc after the blocks have passed.
pt: Se Alice não retornar no meio tempo, Bob pode gastar os 2 btc após os blocos terem passado.
ru: Если Алиса не вернется Боб сможет потратить 2 BTC когда будет смайнено указанное количество блоков.

source: If Alice returns, she can create a new transaction that invalidates the one sending money to Bob.
pt: Se Alice voltar antes, ela pode criar uma nova transação que invalide a transação enviando dinheiro ao Bob.
ru: Если Алиса вернется в течении 10 дней, она может создать новую транзакцию, которая сделает недействительной предыдущую отправку биткоинов Бобу.

source: It might not sound like much of difference, but the flexibility in these two models allow some cool and useful types of transactions, such as the ones needed for the lightning network.
pt: Pode não parecer uma grande diferença, mas a flexibilidade destes dois modelos permite alguns tipos de transações muito interessantes e úteis, como as que precisamos para a Lightning Network.
ru: Может показаться что эти два вида таймлоков имеют небольшое различие, но именно они обеспечивает требуемую гибкость для создания некоторых интересных и полезных типов транзакций, необходимых, например, для работы Lighnting Network.

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão
ru: Автор: Patrícia Estevão

source: Editor: Marco Agner
ru: Редактор: Marco Agner

source: Main source: https://en.bitcoin.it/wiki/Timelock
pt: Principal fonte: https://en.bitcoin.it/wiki/Timelock
ru: Основной источник: https://en.bitcoin.it/wiki/Timelock
