Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: understanding-the-lightning-network-part-2/*.po
Languages: pt, ru

source: Understanding the Lightning Network - Part 2:
pt: Entendendo a Lightning Network - Parte 2:
ru: Принцип работы Lightning Network - Часть 2:

source: Shaping the network
pt: Formando a Rede
ru: Формируем сеть

source: Adding a new party
pt: Adicionando um novo usuário
ru: Добавляем нового участника

source: Alice and Bob have already succeeded in creating a bidirectional payment channel. Now, Alice wants to pay 1 bitcoin to her friend Carol.
pt: Alice e Bob já conseguiram criar um canal de pagamento bidirecional. Agora, Alice quer pagar 1 bitcoin para Carol, sua amiga.
ru: Алиса и Боб успешно создали между собой двунаправленный платёжный канал. Но теперь Алиса хочет заплатить 1 биткоин своей подруге Кэрол.

source: Instead of creating a channel between Alice and Carol, Carol will be added to the payroll using the already stablished channel.
ru: Вместо создания нового прямого канала между Кэрол и Алисой, Кэрол получит деньги по уже имеющемуся каналу между ней и Бобом.

source: Here’s the general idea of how it will work:
pt: De uma forma superficial, funciona assim:
ru: Вот общая идея, как это работает:

# ./understanding-the-lightning-network-part-2/source-text.txt:16
source: Step-by-step
ru: Рассмотрим пошагово

source: Carol creates a secret and sends its hash to Alice.
pt: Carol cria um segredo e envia o hash dele para Alice.
ru: Кэрол создает "секрет" и посылает его хеш Алисе.

source: Carol’s secret hash
pt: Hash do segredo da Carol
ru: Хэш "секрета" Кэрол

source: sends to Alice
pt: envia para Alice
ru: передает Алисе

source: Carol gives her secret to Bob in exchange for a bitcoin.
pt: Carol dá seu segredo a Bob em troca de 1 bitcoin.
ru: Кэрол дает свой "секрет" Бобу в обмен на биткоин.

source: Alice asks Bob to show Carol’s secret and promisses a bitcoin in exchange.
pt: Alice pede a Bob para mostrar o segredo da Carol e promete um bitcoin em troca.
ru: Алиса просит Боба показать "секрет" Кэрол в обмен на биткоин.

source: Alice knows Bob must have gotten the secret from Carol, so she can be sure Carol got her bitcoin.
pt: Alice sabe que Bob só pode ter conseguido o segredo com a Carol, então ela pode estar segura de que Carol recebeu o seu bitcoin.
ru: Алиса знает, что Боб мог получить "секрет" только от Кэрол, и значит Кэрол уже получила свой биткоин.

source: Alice gives Bob one bitcoin.
pt: Alice dá a Bob um bitcoin.
ru: Алиса отдает Бобу один биткоин.

source: Fixing trust issues
pt: Cuidando dos problemas de confiança
ru: Устраняем проблему доверия

source: But what about Bob?
pt: Mas, e o Bob?
ru: Но что на счет Боба?

source: In this scenario, he can be tricked by Carol, if she receives his bitcoin and doesn’t give him the secret, or by Alice, if he shows Carol’s secret and she doesn’t give him a bitcoin.
pt: Neste cenário, ele pode ser fraudado pela Carol, se ela receber o bitcoin e não der o segredo em troca, ou pela Alice, se ele mostrar o segredo da Carol e ela não der o bitcoin em troca.
ru: Ведь тогда он может быть обманут Кэрол, если она получив свой биткоин не отдаст ему "секрет". Или Алисой, если он покажет "секрет" Кэрол, а она не отдаст ему биткоин.

source: To solve that, we are going to rethink these last steps adding a time lock clause called Hash Time-Locked Contracts (HTLC) as protection for Bob.
pt: Para resolver isso, nós vamos re-pensar estes últimos passos adicionando uma tranca temporal chamada Hash Time-Locked Contracts (HTLC) como proteção para o Bob.
ru: Чтобы решить эту проблему, мы в эту схему в качестве защиты для Боба добавим Контракт с хешированной временной блокировкой, называемую Hash Time-Locked Contracts (HTLC).

# ./understanding-the-lightning-network-part-2/source-text.txt:50
source: Step-by-step
ru: Рассмотрим пошагово

source: Alice sends 1 btc to a multisig address that can be unlocked by:
pt: Alice envia 1 bitcoin para um endereço multi-assinatura que pode ser destrancado por:
ru: Алиса отправляет 1 BTC на адрес с мультиподписью который может быть разблокирован:

source: Bob, if he presents Carol’s secret.
pt: Bob, se ele apresentar o segredo da Carol.
ru: Бобом, если он предоставит "секрет" Кэрол.

source: Alice, but only after some time, let’s say 2 weeks.
pt: Alice, mas só depois de algum tempo, vamos considerar 2 semanas.
ru: Алисой, но только через определенное время, например, 2 недели.

source: Alice’s transaction with Bob
pt: Transação da Alice com o Bob
ru: Транзакция Алисы, переданная Бобу

# ./understanding-the-lightning-network-part-2/source-text.txt:60
source: multisig
ru: мультиподпись

source: to Bob’s key + Carol’s secret
pt: p/ a chave to Bob + segredo da Carol
ru: ключ Боба + "секрет" Кэрол

source: to Alice’s key + 14 days
pt: p/ a chave da Alice + 14 dias
ru: ключ Алисы + ожидание 14 дней

source: This means Bob has 2 weeks to perform his deal with Carol and broadcast a transaction that claims this bitcoin. And, if he decides not to go on with his part, Alice can still get her bitcoin back.
pt: Isto significa que o Bob tem 2 semanas para realizar a operação com a Carol e transmitir a transação que clama este bitcoin da Alice. E, se ele der para trás, a Alice ainda pode ter o seu bitcoin de volta.
ru: Значит у Боба есть 2 недели, чтобы совершить сделку с Кэрол и опубликовать транзакцию, претендующую на этот биткоин. А, если он вруг передумает, Алиса все ещё может вернуть свой биткоин.

source: Bob sends 1 btc to a multisig address that can be unlocked by:
pt: Bob envia 1 bitcoin para um endereço multi-assinatura que pode ser destrancado por:
ru: Алиса отправляет 1 BTC на адрес с мультиподписью который может быть разблокирован:

source: Carol, if she presents her secret.
pt: Carol, se ela apresentar seu segredo.
ru: Кэрол, если она предоставит свой "секрет".

source: Bob, but only after some time, let’s say 10 days.
pt: Bob, mas só depois de um tempo, vamos considerar 10 dias.
ru: Бобом, но только через определенное время, например, 10 дней.

source: Bob’s transaction with Carol
pt: Transação do Bob com a Carol
ru: Транзакция Боба переданная Кэрол

# ./understanding-the-lightning-network-part-2/source-text.txt:78
source: multisig
ru: мультиподпись

source: to Carol’s key + Carol’s secret
pt: p/ a chave da Carol + segredo da Carol
ru: ключ Кэрол + "секрет" Кэрол

source: to Bob’s key + 10 days
pt: p/ a chave do Bob + 10 dias
ru: ключ Боба + ожидание 10 дней

source: It’s important for the time lock on this contract to end before the lock on Alice’s contract. Otherwise, Bob is in risk of paying Carol and not getting paid by Alice because she could reclaim her bitcoin.
pt: É essencial que a tranca temporal neste contrato termine antes da tranca no contrato da Alice. Caso contrário, Bob estará em risco de pagar a Carol e não ser pago pela Alice porque ela teria tempo de reclamar seu bitcoin.
ru: Важно, чтобы время блокировки этого контракта было меньше времени блокировки контракта Алисы. В противном случае Боб рискует заплатить Кэрол и не получить плату от Алисы, потому что она сможет вернуть свой биткоин.

source: Carol will present her secret to Bob’s contract, before the 10 days time lock ends, and receive the bitcoin.
pt: Carol apresenta o seu segredo para o contrato de Bob, antes da tranca de 10 dias acabar, e recebe o bitcoin.
ru: Кэрол предоставляет свой секрет по контракту Боба до того, как закончилась 10-дневная блокировка, и получает биткоин.

source: Bob will present Carol’s secret to Alice’s contract, before the end of 14 days, and receive the bitcoin.
pt: Bob apresenta o segredo da Carol para o contrato da Alice, antes da tranca de 14 dias acabar, e recebe o bitcoin.
ru: Боб предоставляет свой секрет по контракту Алисе до того, как закончилась 14-дневная блокировка, и получает биткоин.

source: Alice will have blockchain proof that Carol received her bitcoin (the secret she presented in Bob’s contract).
pt: Alice tem prova da blockchain de que Carol recebeu o bitcoin dela (o segredo que ela apresentou ao contrato de Bob).
ru: У Алисы имеется блокчейн-доказательство, что Кэрол получила свой биткоин ("секрет", который она представила в контракте Боба).

source: The guarantees
pt: As garantias
ru: Гарантии

source: The point of these HTLC contracts is to guarantee some important outcomes:
pt: O propósito destes contratos HTLC é garantir alguns eventos importantes:
ru: Суть этих HTLC-контрактов в том, чтобы гарантированно обеспечивался следующий результат:

source: If Carol presents her secret, stamping it publicly on the blockchain, she is guaranteed to get her bitcoin from Bob.
pt: Se a Carol apresentar o seu segredo, publicando-o na blockchain, ela tem a garantia de receber o bitcoin do Bob.
ru: Если Кэрол раскроет свой "секрет" опубликовав его на публичном блокчейне, она гарантированно получит свой биткоин от Боба.

source: If Carol claims her bitcoin from Bob, Bob is guaranteed to have her secret.
pt: Se a Carol clamar o bitcoin do Bob, Bob tem a garantia de receber o segredo dela.
ru: Если Кэрол заявляет свои права на биткоин от Боба, он гарантированно знает "секрет" Кэрол.

source: If Bob presents Carol’s secret, he’s guaranteed to get a bitcoin from Alice.
pt: Se o Bob apresentar o segredo da Carol, ele tem a garantia de receber o bitcoin da Alice.
ru: Если Боб раскроет "секрет" Кэрол, он гарантированно получит биткоин от Алисы.

source: If Alice sees Carol’s secret on the blockchain, she’s guaranteed that Carol got the payment she was due.
pt: Se Alice ver o segredo da Carol na blockchain, ela tem a garantia de que a Carol recebeu o pagamento que ela devia.
ru: Если Алиса видит "секрет" Кэрол в блокчейне, у нее есть гарантии того что Кэрол получила её платёж.

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão
ru: Автор: Patrícia Estevão

source: Editor: Marco Agner
ru: Редактор: Marco Agner

source: Main resources: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-creating-the-network-1465326903/
pt: Principais fontes: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-creating-the-network-1465326903/
ru: Основной источник: https://bitcoinmagazine.com/articles/understanding-the-lightning-network-part-creating-the-network-1465326903/

source: Instead of creating a channel between Alice and Carol, Carol will be added to the payroll using the already established channel.
pt: Ao invés de criar um canal entre Alice e Carol, Carol será adicionada aos pagamentos usando o canal já estabelecido.

# source-text.txt:16
source: Step-by-step
pt: Passo-a-passo

# source-text.txt:50
source: Step-by-step
pt: Passo-a-passo
