Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: what-does-decentralization-mean-*-bitcoin/*.po
Languages: pt

source: What does Decentralization mean in bitcoin?
pt: O que a Descentralização significa no Bitcoin?

source: Bitcoin is called decentralized because it has no central point of control.
pt: O Bitcoin é dito descentralizado porque não tem nenhum ponto de controle central.

source: Its resources (hardware and software) are distributed around the world and connected remotely in a network.
pt: Os seus recursos (hardware e software) são distribuídos ao redor do mundo e conectados remotamente em uma rede.

source: And the “authority” to decide over Bitcoin is divided between its network participants.
pt: E a “autoridade” para tomar decisões no Bitcoin é dividida entre os participantes da rede.

source: Who are the participants?
pt: Quem são os participantes?

source: The shared responsibility includes the following agents:
pt: A responsabilidade compartilhada inclui os seguintes agentes:

source: Nodes
pt: Nós

source: Transaction is valid
pt: Transação válida

source: Verify and relay transactions.
pt: Verifica e transmite transações.

source: Miners
pt: Mineradores

source: Secure transactions by writing and ordering them on the blockchain in exchange for fees and newly minted bitcoins.
pt: Asseguram transações ao escrever-las e ordená-las na blockchain em troca de taxas e de bitcoins recém-minerados.

source: Until the ~21 million limit is reached.
pt: Até o limite de ~21 milhões ser alcançado.

source: Both roles can be played by anyone willing to commit the resources to it, there’s no permission to be asked.
pt: Ambos papéis podem ser preenchidos por qualquer um que queira investir os recursos necessários, não se requer nenhuma permissão.

source: Look, I’m mining.
pt: Olhe, estou minerando.

source: What are the implications?
pt: Quais são as implicações?

source: Miners and nodes are responsible for a decentralized economic policy, replacing the need for a central bank to take care of currency issuance and clearing functions.
pt: Mineradores e nós são responsáveis por uma política econômica descentralizada, não havendo a necessidade de um banco central para cuidar da emissão de moedas e da compensação de transações.

source: CENTRAL BANK
pt: BANCO CENTRAL

source: Permanent vacation
pt: Férias permanentes

source: Bitcoin’s decentralization is a protection against a single point of failure.
pt: A descentralização do Bitcoin é uma proteção contra um único ponto de falha.

source: That means it’s robust in face of external intervention because there’s no single entity to be attacked or corrupted.
pt: Isto significa que ele é robusto frente à intervenção externa porque não há uma única entidade para ser atacada ou corrompida.

source: Where do we attack?
pt: Onde atacamos?

source: But this decentralization is not a guaranteed feature and there are risks to it as well.
pt: Mas esta descentralização não é uma característica garantida e também há riscos que vêm com ela.

source: We’ll explore some of these issues in the continuation of this infographic.
pt: Nós vamos explorar alguns destes problemas na continuação deste infográfico.

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão

source: Sources: Mastering Bitcoin by Andreas Antonopoulos. Available at https://github.com/bitcoinbook/bitcoinbook
pt: Fontes: Mastering Bitcoin por Andreas Antonopoulos. Disponível em https://github.com/bitcoinbook/bitcoinbook
