Repository: 21Lectures/bitcoindesigned-infographics-i18n
Catalog: what-*-a-multisig-wallet/*.po
Languages: pt, ru

source: The Lightning network basics series
pt: Os Fundamentos da Lightning Network
ru: Основы Lightning Network

source: What is a multisig (aka multisignature) wallet?
pt: O que é uma carteira multisig (multi-assinatura)?
ru: Что такое кошелёк с мультиподписью (multisig)?

source: regular wallet
pt: carteira convencional
ru: обычный кошелёк

source: One key is required to authorize money transfer, i.e. sign a transaction.
pt: Uma chave é pedida para autorizar a transferência de valor, isto é, assinar a transação.
ru: Чтобы сделать перевод, т.е. подписать транзакцию, требуется один ключ.

source: Multisig wallet
pt: Carteira multisig
ru: Кошелёк с мультиподписью

source: More than one key may be required to sign each transaction.
pt: Mais de uma chave pode ser requerida para assinar cada transação.
ru: Чтобы подписать транзакцию требуется более одного ключа.

source: m-of-n
pt: m-de-n
ru: m-из-n

source: The m-of-n scheme means that the wallet is associated with m keys and each time a transaction needs to be broadcast, n of those m keys need to sign it.
ru: Что означает "m-из-n"? Имеем кошелёк с m ключами. Из этого количества m каждый раз для подписания транзакций нам требуется n ключей.

source: m keys
ru: m ключей

source: n signatures
ru: n подписей

source: What’s the point?
pt: Por que isto?
ru: Зачем это нужно?

source: The main use case for multisig wallets is to increase security of funds.
pt: O principal caso de uso para carteiras multi-assinatura é aumentar a segurança dos fundos.
ru: В основном, кошельки с мультиподписью используются для повышения безопасности хранения средств.

source: Examples
pt: Exemplos
ru: Примеры

source: Decentralizing risks independently.
pt: Descentralizando riscos de forma independente.
ru: Самостоятельная децентрализация риска.

source: John associates his wallet with two keys, each stored in a different machine. If one machine is hacked, he won’t loose his bitcoins instantly.
pt: João associa sua carteira a duas chaves, cada uma armazenada em um aparelho diferente. Se um deles for hackeado, ele não perderá seus bitcoins instantaneamente.
ru: Джон связал свой кошелек с двумя ключами, хранящихся на разных машинах. Если одна из машин будет взломана, он не потеряет свои биткоины.

source: Security with redundancy.
pt: Segurança com redundância.
ru: Безопасность с резервированием.

source: Lisa has a 2-of-3 wallet address and keeps the 3 keys in separate places to avoid theft. If one of the keys is lost, she can still access her bitcoins.
pt: Luisa tem um endereço 2-de-3 em sua carteira e mantém as 3 chaves em locais separados para evitar roubo. Se uma das chaves for perdida, ela ainda pode acessar os bitcoins.
ru: У Лизы есть кошелёк 2-из-3 и чтобы избежать кражи она хранит все 3 ключа в разных местах. Если один из ключей потеряется, Лиза все равно будет иметь доступ к своим биткоинам.

source: Bank
pt: Banco
ru: Банк

source: Decentralizing risks with help.
pt: Descentralizando riscos com auxílio.
ru: Децентрализация рисков с помощью.

source: Sophie’s business has a multisig address and shares the responsibility of signing transactions with a security specialized company that holds one of the needed keys for spending. So if Sophie is hacked, her coins are still protected.
pt: O negócio de Sofia tem um endereço multisig e divide a responsabilidade de assinar transações com uma empresa de segurança especializada que possui uma das chaves necessárias para realizar gastos. Se a Sofia for hackeada, o seu dinheiro ainda estará protegido.
ru: Бизнес Софии разделяет ответственность по подписанию транзакций со специализированной компанией по безопасности, которая хранит один из необходимых ключей для подтверждения расходов. Если Софи взломают, её биткоины будут защищены.

source: Managing trust.
pt: Administrando a confiança.
ru: Управление доверием.

source: Company LOL has a 3-of-5 Bitcoin wallet with its resources and each key is hold by one of its executives. In order to move money, 3 of them have to sign the transaction, making sure at least the majority agrees with the spending.
pt: A companhia LOL tem uma carteira 3-de-5 com seus recursos e cada uma das chaves é guardada por um de seus executivos. Para mover o dinheiro, 3 deles precisam assinar a transação, garantindo que pelo menos a maioria está de acordo com o gasto.
ru: У компании LOL есть Биткоин-кошелек 3-из-5, и каждый ключ принадлежит одному из его руководителей. Для перевода средств требуется чтобы по крайней мере большинство было согласно, это обеспечивается необходимостью 3 ключей для подписания транзакции.

source: Author: Patrícia Estevão
pt: Autora: Patrícia Estevão
ru: Автор: Patrícia Estevão

source: Editor: Marco Agner
ru: Редактор: Marco Agner

source: The m-of-n scheme means that the wallet is associated with n keys and each time a transaction needs to be broadcast, m of those n keys need to sign it.
pt: O esquema m-de-n significa que a carteira é associada a n chaves e, a cada vez que uma transação precisa ser feita, m daquelas n chaves são necessárias para assiná-la.

source: n keys
pt: n chaves

source: m signatures
pt: m assinaturas
